<div class="details-product">
    <div class="detail-product__img">
        <img src="imgs/Petshop_files/whiskas-product.png" alt="">
    </div>
    <div class="details-product__details">
        <div class="detail__name-code">
            <h4>Petisco Dreamies para Gatos Adultos Sabor Queijo</h4>  
            <p>Cod: 31012123</p>
        </div>

        <div class="detail__price">
            <p class="detail-price__defined">R$32,00</p>
            <p class="detail-price__cutted">R$50,00</p>
        </div>

        <div class="size-specified">
            <div class="size-quantity">
                <div class="size-form-flex">
                    <h2>Tamanho</h2>
                    <form class="size-quantity__form">
                        <label>
                            <input type="radio" name="tamanho" value="40g" />
                            <span class="size-product__btn">40g</span>
                        </label>

                        <label>
                            <input type="radio" name="tamanho" value="80g" />
                            <span class="size-product__btn">80g</span>
                        </label>

                        <label>
                            <input type="radio" name="tamanho" value="140g" />
                            <span class="size-product__btn">140g</span>
                        </label>
                    </form>
                </div>

                <div class="quantity-product">
                    <div class="quantity-product__buttons">
                        <button class="btn-quantity__button" data-action="decrease">
                            <svg width="24" height="4" viewBox="0 0 24 4" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.2857 3.71428H1.71429C1.25963 3.71428 0.823594 3.53366 0.502103 3.21217C0.180612 2.89068 0 2.45465 0 1.99999C0 1.54533 0.180612 1.1093 0.502103 0.787809C0.823594 0.466318 1.25963 0.285706 1.71429 0.285706H22.2857C22.7404 0.285706 23.1764 0.466318 23.4979 0.787809C23.8194 1.1093 24 1.54533 24 1.99999C24 2.45465 23.8194 2.89068 23.4979 3.21217C23.1764 3.53366 22.7404 3.71428 22.2857 3.71428Z" fill="white"/>
                            </svg>
                        </button>

                        <input class="input-quantity" type="number" min="1" value="1" />
        
                        <button class="btn-quantity__button" data-action="increase">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.2857 13.7143H13.7143V22.2857C13.7143 22.7404 13.5337 23.1764 13.2122 23.4979C12.8907 23.8194 12.4547 24 12 24C11.5453 24 11.1093 23.8194 10.7878 23.4979C10.4663 23.1764 10.2857 22.7404 10.2857 22.2857V13.7143H1.71429C1.25963 13.7143 0.823594 13.5337 0.502103 13.2122C0.180612 12.8907 0 12.4547 0 12C0 11.5453 0.180612 11.1093 0.502103 10.7878C0.823594 10.4663 1.25963 10.2857 1.71429 10.2857H10.2857V1.71429C10.2857 1.25963 10.4663 0.823593 10.7878 0.502102C11.1093 0.180611 11.5453 0 12 0C12.4547 0 12.8907 0.180611 13.2122 0.502102C13.5337 0.823593 13.7143 1.25963 13.7143 1.71429V10.2857H22.2857C22.7404 10.2857 23.1764 10.4663 23.4979 10.7878C23.8194 11.1093 24 11.5453 24 12C24 12.4547 23.8194 12.8907 23.4979 13.2122C23.1764 13.5337 22.7404 13.7143 22.2857 13.7143Z" fill="white"/>
                            </svg>
                        </button>
                    </div>
                </div>
            </div>

            <div class="specifieds">
                <h5>Especificações</h5>
                <ul class="specifieds-list">
                    <li>
                        <p>Indicação</p>
                        <p>Gatos</p>
                    </li>
                    <li>
                        <p>Porte</p>
                        <p>Grande, Médio, Pequeno</p>
                    </li>
                    <li>
                        <p>Idade</p>
                        <p>Filhote, Adulto, Idosos</p>
                    </li>
                    <li>
                        <p>Marca</p>
                        <p>Pipicat</p>
                    </li>
                </ul>
            </div>
        </div>

        <div class="resume-details">
            <div class="resume-details__about-product">
                <span class="resume-details__title">Resumo</span>
                <p class="resume-details__text">- Petisco para toda hora. - Rende mais de 20 dias (*3 pedacinhos ppor dia); - Pedacinhos crocantes por fora, macios por dentro; - Diversão e mais momentos junto com seu gatinho.</p>
            </div>

            <div class="resume-details__about-product">
                <span class="resume-details__title">Detalhes</span>
                <p class="resume-details__text">São deliciosos petiscos em três diferentes sabores: Carne, Frango e Queijo. Seu gato vai sonhar com os pedacinhos  recheados todos os dias. Descubra qual é o favorito do seu gato!</p>
            </div>
        </div>
    </div>
</div>

<div class="finalize-buy">
    <div class="calc-frete">
        <div class="frete__search-input">
            <input type="search" placeholder="Calcular o frete" />
            <button type="submit">
                <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13.5 12H12.71L12.43 11.73C13.055 11.004 13.5117 10.1488 13.7676 9.22562C14.0234 8.30246 14.0721 7.33416 13.91 6.39001C13.44 3.61001 11.12 1.39001 8.32 1.05001C7.33562 0.925471 6.33579 1.02778 5.39703 1.34909C4.45827 1.67041 3.60545 2.20222 2.90384 2.90384C2.20222 3.60545 1.67041 4.45827 1.34909 5.39703C1.02778 6.33579 0.925471 7.33562 1.05001 8.32C1.39001 11.12 3.61001 13.44 6.39001 13.91C7.33416 14.0721 8.30246 14.0234 9.22562 13.7676C10.1488 13.5117 11.004 13.055 11.73 12.43L12 12.71V13.5L16.25 17.75C16.66 18.16 17.33 18.16 17.74 17.75C18.15 17.34 18.15 16.67 17.74 16.26L13.5 12ZM7.50001 12C5.01 12 3.00001 9.99001 3.00001 7.50001C3.00001 5.01 5.01 3.00001 7.50001 3.00001C9.99001 3.00001 12 5.01 12 7.50001C12 9.99001 9.99001 12 7.50001 12Z" fill="#45CAF7" />
                </svg>
            </button>
        </div>

        <button class="frete-button">
            <svg width="22" height="16" viewBox="0 0 22 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M17 14.5C17.83 14.5 18.5 13.83 18.5 13C18.5 12.17 17.83 11.5 17 11.5C16.17 11.5 15.5 12.17 15.5 13C15.5 13.83 16.17 14.5 17 14.5ZM18.5 5.5H16V8H20.46L18.5 5.5ZM5 14.5C5.83 14.5 6.5 13.83 6.5 13C6.5 12.17 5.83 11.5 5 11.5C4.17 11.5 3.5 12.17 3.5 13C3.5 13.83 4.17 14.5 5 14.5ZM19 4L22 8V13H20C20 14.66 18.66 16 17 16C15.34 16 14 14.66 14 13H8C8 14.66 6.66 16 5 16C3.34 16 2 14.66 2 13H0V2C0 0.89 0.89 0 2 0H16V4H19ZM2 2V11H2.76C3.31 10.39 4.11 10 5 10C5.89 10 6.69 10.39 7.24 11H14V2H2ZM9 3L12.5 6.5L9 10V7.5H4V5.5H9V3Z" fill="#1D9BF0"/>
            </svg>
            Frete grátis
        </button>
    </div>

    <div class="list-buy">
        <button class="list-button">
            <svg width="33" height="30" viewBox="0 0 33 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M29.1346 1.68413C24.7803 -1.3759 19.4033 0.0521126 16.5005 3.55414C13.5976 0.0521126 8.22064 -1.3929 3.86631 1.68413C1.5572 3.31614 0.105756 6.07016 0.00679452 8.97719C-0.224117 15.5732 5.4497 20.8603 14.1089 28.9694L14.2738 29.1224C15.5273 30.2954 17.4571 30.2954 18.7106 29.1054L18.892 28.9354C27.5512 20.8433 33.2085 15.5562 32.9941 8.96019C32.8951 6.07016 31.4437 3.31614 29.1346 1.68413ZM16.6654 26.4363L16.5005 26.6063L16.3355 26.4363C8.48453 19.1093 3.30553 14.2642 3.30553 9.35119C3.30553 5.95116 5.77957 3.40114 9.07831 3.40114C11.6183 3.40114 14.0924 5.08416 14.9665 7.41317H18.0509C18.9085 5.08416 21.3826 3.40114 23.9226 3.40114C27.2213 3.40114 29.6954 5.95116 29.6954 9.35119C29.6954 14.2642 24.5164 19.1093 16.6654 26.4363Z" fill="#232323"/>
            </svg>
            Colocar na lista
        </button>

        <button class="pay-button">
            <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13.983 28.5065C13.983 29.0686 13.819 29.6182 13.5117 30.0856C13.2044 30.553 12.7676 30.9174 12.2566 31.1325C11.7456 31.3476 11.1833 31.4039 10.6408 31.2942C10.0983 31.1846 9.60001 30.9139 9.2089 30.5163C8.81779 30.1188 8.55144 29.6124 8.44353 29.061C8.33562 28.5096 8.39101 27.9381 8.60267 27.4187C8.81434 26.8994 9.17279 26.4555 9.63269 26.1431C10.0926 25.8308 10.6333 25.6641 11.1864 25.6641C11.9281 25.6641 12.6394 25.9636 13.1639 26.4966C13.6884 27.0297 13.983 27.7526 13.983 28.5065ZM25.7287 25.6641C25.1756 25.6641 24.6349 25.8308 24.175 26.1431C23.7151 26.4555 23.3567 26.8994 23.145 27.4187C22.9333 27.9381 22.8779 28.5096 22.9858 29.061C23.0938 29.6124 23.3601 30.1188 23.7512 30.5163C24.1423 30.9139 24.6406 31.1846 25.1831 31.2942C25.7256 31.4039 26.2879 31.3476 26.7989 31.1325C27.3099 30.9174 27.7467 30.553 28.054 30.0856C28.3613 29.6182 28.5253 29.0686 28.5253 28.5065C28.5253 27.7526 28.2307 27.0297 27.7062 26.4966C27.1817 25.9636 26.4704 25.6641 25.7287 25.6641ZM32.9258 8.54304L29.1098 21.149C28.8662 21.9642 28.3704 22.6779 27.6961 23.184C27.0218 23.6902 26.2048 23.9618 25.3665 23.9587H11.5961C10.7458 23.9559 9.91929 23.6731 9.24042 23.1527C8.56154 22.6324 8.06685 21.9024 7.83048 21.0722L3.04969 4.06204H1.67796C1.23294 4.06204 0.806141 3.88236 0.491463 3.56253C0.176784 3.2427 0 2.80892 0 2.35661C0 1.9043 0.176784 1.47052 0.491463 1.15069C0.806141 0.830862 1.23294 0.651184 1.67796 0.651184H3.47058C4.07792 0.653091 4.66828 0.855099 5.1531 1.2269C5.63791 1.59871 5.99104 2.12027 6.15951 2.71333L7.17887 6.33594H31.3219C31.5845 6.33592 31.8434 6.39854 32.0779 6.51877C32.3123 6.639 32.5158 6.81348 32.6718 7.02817C32.8278 7.24286 32.932 7.49178 32.9762 7.75489C33.0203 8.01799 33.003 8.28795 32.9258 8.54304ZM29.0497 9.74679H8.1367L11.0578 20.1357C11.0912 20.2545 11.1618 20.3591 11.259 20.4334C11.3561 20.5078 11.4745 20.548 11.5961 20.5478H25.3665C25.4863 20.5481 25.6029 20.5093 25.6993 20.4371C25.7957 20.365 25.8668 20.2633 25.9021 20.147L29.0497 9.74679Z" fill="white"/>
            </svg>
            Comprar por R$32,00
        </button>
    </div>

</div>